#### RectangularGridSegmentOrientation Enumeration

---

|  |
| --- |
| See Also |

The orientation type of rectangular grid segment.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum RectangularGridSegmentOrientation ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RectangularGridSegmentOrientation ``` |

| Visual C++ |
| --- |
| ``` public enum class RectangularGridSegmentOrientation ``` |

# Members

| Member name | Description |
| --- | --- |
| Vertical | A vertical GridSegment |
| Horizontal | A horizontal GridSegment |

# See Also

Autodesk.Revit.DB Namespace